In [3]:
import pandas as pd

In [4]:
!pwd

/Users/danielaarias/Ironhack/Taller_API/Notebooks

In [5]:
data_a = pd.read_excel("../Data/Athletes.xlsx")

In [6]:
data_a.head()

                Name     NOC           Discipline
0    AALERUD Katrine  Norway         Cycling Road
1        ABAD Nestor   Spain  Artistic Gymnastics
2  ABAGNALE Giovanni   Italy               Rowing
3     ABALDE Alberto   Spain           Basketball
4      ABALDE Tamara   Spain           Basketball

In [8]:
data_a.shape

(11085, 3)

In [10]:
!pwd

/Users/danielaarias/Ironhack/Taller_API/Notebooks

In [11]:
data_b = pd.read_excel("../Data/Coaches.xlsx")

In [12]:
data_b.head()

              Name            NOC  Discipline Event
0  ABDELMAGID Wael          Egypt    Football   NaN
1        ABE Junya          Japan  Volleyball   NaN
2    ABE Katsuhiko          Japan  Basketball   NaN
3     ADAMA Cherif  Côte d'Ivoire    Football   NaN
4       AGEBA Yuya          Japan  Volleyball   NaN

In [17]:
data_c = pd.read_excel("../Data/EntriesGender.xlsx")

In [18]:
data_c.head()

            Discipline  Female  Male  Total
0       3x3 Basketball      32    32     64
1              Archery      64    64    128
2  Artistic Gymnastics      98    98    196
3    Artistic Swimming     105     0    105
4            Athletics     969  1072   2041

In [19]:
data_d = pd.read_excel("../Data/Teams.xlsx")

In [20]:
data_d.head()

      Name      Discipline                         NOC  Event
0  Belgium  3x3 Basketball                     Belgium    Men
1    China  3x3 Basketball  People's Republic of China    Men
2    China  3x3 Basketball  People's Republic of China  Women
3   France  3x3 Basketball                      France  Women
4    Italy  3x3 Basketball                       Italy  Women